["```\n#    `flow-cat * | flow-report`\n  #     --- ---- ---- Report Information --- --- ---\n  #    build-version:        flow-tools 0.68.4\n❶ #    name:                 default\n❷ #    type:                 summary-detail\n❸ #    options:              +header,+xheader,+totals\n❹ #    fields:               +other\n❺ #    records:              0\n  #    first-flow:           1322715601 Thu Dec  1 00:00:01 2011\n  #    last-flow:            1322719199 Thu Dec  1 00:59:59 2011\n  #    now:                  1325460205 Sun Jan  1 18:23:25 2012\n  #\n  #    mode:                 streaming\n  #    compress:             off\n  #    byte order:           little\n  #    stream version:       3\n❻ #    export version:       5\n  #\n❼ #    ['/usr/local/bin/flow-rptfmt', '-f', 'ascii']\n```", "```\n❶    Ignores:                 0\n     Total Flows:             54286\n     Total Octets:            633669712\n     Total Packets:           996238\n❷    Total Duration (ms):     884588200\n❸    Real Time:               1322719199\n❹    Average Flow Time:       16294.000000\n❺    Average Packets/Second:  636.000000\n     Average Flows/Second:    11672.000000\n     Average Packets/Flow:    18.000000\n❻    Flows/Second:            0.042795\n     Flows/Second (real):     0.000044\n```", "```\n❶ 1-32   ❸64  96  128  160  192  224  256  288  320  352  384  416  448  480\n❷ .000 ❹.232 .443 .067 .157 .045 .008 .005 .004 .003 .011 .003 .002 .001 .002\n\n      512  544  576 1024 1536 2048 2560 3072 3584 4096 4608\n     .001 .001 .001 .006 .008 .000 .000 .000 .000 .000 .000\n```", "```\n❶  1    2    4 ❸ 8   12   16   20   24   28   32   36   40   44   48   52\n❷ .307 .051 .135 .235 .072 .041 .032 .023 .019 .013 .012 .006 .004 .004 .003\n\n       60  100  200  300  400  500  600  700  800  900 >900\n      .005 .013 .013 .003 .002 .001 .001 .000 .000 .000 .003\n```", "```\n❶ 32   64  128  256  512 1280 2048 2816 3584 4352 5120 5888 6656 7424 8192\n❷ .000 .070 .173 .129 .097 .208 .115 .029 .028 .016 .017 .023 .011 .009 .005\n\n     8960 9728 10496 11264 12032 12800 13568 14336 15104 15872 ❹ >15872\n     .004 .004  .003  .003  .003  .002  .002  .002  .002  .001 ❸ .043\n```", "```\n❷ 10    50  100  200  500 1000 2000 3000 4000 5000 6000 7000 8000 9000 10000\n❶ .158 .100 .088 .084 .157 .085 .036 .019 .017 .010 .009 .007 .007 .010 .009\n\n    12000 14000 16000 18000 20000 22000 24000 26000 28000 30000  >30000\n     .014  .008  .006  .008  .007  .005  .003  .003  .004  .004 ❸ .141\n```", "```\n# `flow-cat * | flow-report -v TYPE=```", "```\n\nI'll use variables throughout the rest of this section to modify reports and then explore the different report types.\n\n## Using Variables: Report Type\n\nOne question you might hear from an interested manager^([[8](#ftn.CHP-5-FN-1)]) is \"What computer talks the most?\" The report type `ip-source-address` displays how much traffic each host puts on the network.\n\n```", "```\n\nWith this report you get a list of IP addresses and the number of flows, octets, and packets sent by that host, as well as the total duration of all flows to this host in milliseconds. The data in this report is presented, in no particular order, as a list of IP addresses and traffic measurements, which demonstrates that you must know exactly what you mean by \"busiest host.\" Is it the host that sends the greatest amount of traffic (octets)? Is it the host involved in the greatest number of connections (flows)? Or is it the host that sends the greatest number of individual packets?\n\n## Using Variables: SORT\n\nScrolling through a long report in search of the host that sends the most traffic isn't terribly effective. Instead, use the `SORT` variable to tell `flow-report` how to order the data.\n\nYou can assign `SORT` the value of the name of any field in a report. However, the fields are not necessarily the same as the names of the columns. The report header contains the fields entry, which lists the valid fields in the report type in the order they appear in the report. Here's the header information on fields from the `ip-source-address` report:\n\n```", "```\n\nThe actual report includes the columns `ip-source-address`, `flows`, `octets`, `packets`, and `duration`, as shown here:\n\n```", "```\n\nNote that the list of fields starts with an entry named `key` and follows that with entries called `flows`, `octets`, `packets`, `duration`, and `other`. The actual report starts with a column called `ip-source-address` and follows that with the fields `flows`, `octets`, `packets`, and `duration`. `flow-report` calls the field it's reporting on the *key*. I ran the `ip-source-address` report, so the key is the `ip-source-address` field. (This report has no `other` column, despite its presence in the list of fields.)\n\nTo sort by a column in descending order, assign the `SORT` variable the field name with a leading plus sign. To sort by a column in ascending order, assign the `SORT` variable the field name with a leading minus sign.\n\nI'm interested in the host that creates the greatest number of connections, or flows, so I'll assign `SORT` the value `+flows` to sort the data by flows in descending order, like so:\n\n```", "```\n\nThe host 192.0.2.4 (❶) has sent 54,280 flows, almost four times as many as the next highest host.\n\nAt first glance, it might appear that sorting by flows also sorts by bytes (octets) to a certain degree, but that's illusionary. Here I report on the same data sorted by octets:\n\n```", "```\n\nWhen you compare the list of hosts that send the greatest number of octets to the list of hosts that send the greatest number of flows, notice that four of the top six hosts on each list don't even appear in the other list!\n\n* * *\n\n^([[8](#CHP-5-FN-1)]) The quickest way to make your manager lose interest is to answer this question in appalling detail. This might seem cruel, but it's best for everyone involved.\n\n# Analyzing Individual Flows from Reports\n\nLook back at the `ip-source-address` report from in [Using Variables: SORT](ch05s02.html#using_variables_colon_sort \"Using Variables: SORT\") in [Using Variables: Report Type](ch05s02.html#using_variables_colon_report_type \"Using Variables: Report Type\"). Notice how the host 207.46.209.247 used the most bandwidth, 131,391,013 octets. That's 131,391,013 divided by 1,024, which is about 128,312KB, or 125MB. The obvious question is \"What did that host send in all those octets with but so few flows?\"\n\nTo find out, use `flow-nfilter` to answer that question. Because this is a one-off query that probably won't be repeated, just configure the filter on the command line.\n\n```", "```\n\nThanks to this report, you can see that this connection ran over TCP (❶) and that it came from port 80 to a high-numbered port (❷). This is obviously a response from a web server. In this case, the destination IP happens to be my main proxy server. I can search my proxy logs and probably identify this traffic more exactly.\n\nUnfortunately, web traffic isn't quite that simple. People frequently browse and click through many pages on a website, perhaps downloading data from many different places on the site or maybe downloading a single large file. How can you know whether this data represents a single large download or a bunch of smaller requests? There's no way to be certain, but one way to check is to compare the connections coming from that address to the connections going to that address.\n\nTo do so, you can change the filter to check for flows going to 207.46.209.247\\. You'll need the start and stop times for each flow to see whether new connections are starting or whether each flow is an independent request. `flow-print` format 5 displays timing information with each flow, so I use that to display my filtered data. (I've removed several irrelevant fields, such as the protocol, interface, packets, and octets, from this example to make the output fit on the page.)\n\n```", "```\n\nThe first flow (❶) starts at 1201.11:58:00.409, or 11:58 **am** and .409 seconds, on December 1, and ends at 12:05:55.917\\. A second request at ❷ begins milliseconds later and ends at about the same time. These are clearly two separate HTTP requests.\n\nWhat makes this output interesting is the timing of the other requests. Two more requests begin at ❸ exactly five minutes after the first two, and two more begin at ❹ five minutes after that. By viewing the requests rather than the responses to the requests, it becomes very obvious that something on your network is accessing this site (❺) every five minutes. People do not behave in such a mechanistic manner. The sensible assumption is that a piece of software is responsible for this traffic.\n\nThis report gives exact timestamps for when these repeating, high-bandwidth HTTP requests begin and end, which is all you need in order to find the site in your proxy logs. (In this particular case, this turned out to be clients downloading patches from Microsoft instead of using the corporate update server.)\n\n### Note\n\nIf you have no proxy server, you aren't logging Internet usage. You can do flow analysis on your internal network to identify the specific workstations that were making these requests and see what those workstations have in common, but that's all. If the activity is ongoing, use your packet sniffer to identify what site the workstations are trying to reach.\n\n# Other Report Customizations\n\nJust as the `SORT` variable adjusts data display, other variables further change a report's format, allowing you to create a report that contains exactly the information you need, presented in the most usable manner. I'll modify the `ip-source-address` report I ran earlier this chapter to demonstrate exactly how each of these variables changes a report.\n\n## Choosing Fields\n\nPerhaps you specifically want to know the number of bytes (or packets) sent by a host, and you don't care about the other information provided by a report. The `FIELDS` variable lets you select the columns to include in a report.\n\nFor example, the `ip-source-address` report includes five fields: `address`, `flows`, `octets`, `packets`, and `duration`. Say you want to remove the duration column from your report. To do so, give the `FIELDS` variable the value of the field you want to remove, with a leading minus sign, as shown here with `-duration`:\n\n```", "```\n\nTo remove multiple `FIELDS` values, separate each with commas. Here I've removed everything except the IP address and the number of octets:\n\n```", "```\n\nIf extraneous data confuses your audience, consider trimming unneeded fields.\n\n## Displaying Headers, Hostnames, and Percentages\n\nThe `OPTIONS` variable controls miscellaneous report settings. `flow-report` supports five options, but not all report types support all options, and not all options make sense for every report type. The effect of different options varies with the type of report being run. The report header shows the options used in a report.\n\n```", "```\n\n*   The `header` option tells `flow-report` to include the generic informational header consisting of the name of the report type, the time of the last flow in the data, and so on. You saw an example of a flow report header in [Default Report](ch05.html#default_report \"Default Report\") in [Default Report](ch05.html#default_report \"Default Report\").\n\n*   The `xheader` option tells `flow-report` to provide extra header information. Not all report types have extra header information. In some reports, the extra header information is identical to the regular header information. Try this option to see what it does with a given report type.\n\n*   With the `totals` option, `flow-report` includes the total values of the information being reported on. Not all reports include this, because not all information can be totaled. (You cannot sensibly add IP addresses together, for example!)\n\n*   The `percent-total` option provides the information as a percentage of the total rather than an absolute amount. For example, in the `source-ip-address` report, the flows from a particular host would appear as a percentage of the total number of flows rather than the actual number of flows.\n\n*   Finally, the `names` option tells `flow-report` to use names rather than numbers. This option makes `flow-report` perform a DNS query for each IP address in the report, which makes reports with IP addresses run extremely slowly. Reports with a limited number of hosts can run reasonably quickly, however, and pulling information from static files such as */etc/protocols* and */etc/services* is very quick.\n\nTo remove options from an existing report, put a minus sign (`-`) before the option name in the `OPTIONS` variable. In the following example, I've removed all header information from the `ip-source-address` report and am presenting only the report data:\n\n```", "```\n\nThe minus sign before `header` at ❶ tells `flow-report` to remove this value from the list of options.\n\nAdding options is a little more complicated. Once you start adding options, `flow-report` assumes that you will list all desired options. The default report includes the options `header`, `xheader`, and `totals`. To retain all of these and add the `percent-total` option, list them all on the command line, separated by commas, as shown here:\n\n```", "```\n\n### Note\n\nIf I were to include only the `+percent-total` option, `flow-report` would not use any other options even though they are the default.\n\n## Presenting Reports in HTML\n\n`flow-report` formats its output through an external program, `flow-rptfmt`. Most of `flow-rptfmt`'s features overlap `flow-report` functions, such as setting sorting order or choosing fields to display, but you can have `flow-rptfmt` create HTML with the `-f html` flag. Use the `RPTOPT` variable to pass commands to `flow-rptfmt`.\n\n```", "```\n\nYou'll consider `flow-rptfmt` further when I show how to create customized reports.\n\n# Useful Report Types\n\n`flow-report` supports more than 70 types of reports and lets you analyze your traffic in more ways than you may have thought possible. In this section, I'll demonstrate the most commonly useful report types. Read the `flow-report` man page for the complete list.\n\n### Note\n\nMany of these reports are most useful when presented in graphical format or when prepared on a filtered subset of data. You'll look at how to do both of these later in this chapter.\n\n## IP Address Reports\n\nMany traffic analysis problems focus on individual IP addresses. You've already spent some quality time with the `ip-source-address` report. These reports work similarly, but they have their own unique characteristics.\n\n### Highest Data Exchange: ip-address\n\nTo report on all flows by host, use the `ip-address` report. This totals both the flows sent and the flows received by the host. Here, you look for the host that processed the largest number of octets on the network. You lose the data's bidirectional nature, but this report quickly identifies your most network-intensive host.\n\n```", "```\n\n### Flows by Recipient: ip-destination-address\n\nThis is the opposite of the `ip-source-address` report I used as an example report throughout the beginning of this chapter. It reports on traffic by destination address.\n\n```", "```\n\nIn this example, the host 158.43.128.72 has received 16,478 flows in 1,090,268 octets. Lots of people transmitted data to this host. You don't know whether this data is the result of connections initiated by this host or whether many hosts are connecting to this host. To answer that, you have to look at the actual connections. Use `flow-nfilter` to trim your data down to show only the flows involving this host, and use `flow-print` to see the data.\n\n### Most Connected Source: ip-source-address-destination-count\n\nMany worms scan networks trying to find vulnerable hosts. If you have a worm infection, you'll want to know which host sends traffic to the greatest number of other hosts on the network. The `ip-source-address-destination-count` report shows exactly this.\n\n```", "```\n\nThis report shows you that the host 192.0.2.37 (❶) sent flows to 1,298 (❷) other hosts, as well as the number of flows, octets, and packets of these connections.\n\n### Most Connected Destination: ip-destination-address-source-count\n\nYou can also count the number of sources that connect to each destination. This is similar to the previous report but will contain slightly different data. Some flows (such as broadcasts and some ICMP) go in only one direction, so you must consider destinations separately from sources.\n\n```", "```\n\nThe `ip-source-address-destination-count` and `ip-destination-address-source-count` reports give additional insight into the key servers, resources, and users on your network, even when you don't have problems.\n\nREPORTS THAT DON'T SORT BY EVERYTHING\n\nSome reports don't offer the opportunity to sort by every field. For example, the two interconnectedness reports cannot sort by the number of hosts an address connects to. This is annoying, especially because this is precisely what you're interested in if you're running this report! On most flavors of Unix you can sort by a column by piping the output through `sort -rnk columnnumber`, as shown here:\n\n```", "```\n\n## Network Protocol and Port Reports\n\nThese reports identify the network ports used by TCP and UDP flows or, on a larger scale, just how much traffic is TCP, UDP, and other protocols.\n\n### Ports Used: ip-port\n\nForget about source and destination addresses. What TCP and UDP protocols are the most heavily used on your network? The `ip-port` report tells you.\n\n```", "```\n\nThis looks suspiciously like assorted Internet services. Port 80 (❶) is regular web traffic; port 25 (❷) is email; and port 443 (❸) is encrypted web traffic. You can see how much traffic involves each of these ports, but it's a combination of inbound and outbound traffic. For example, you know that 63,344 (❹) flows either started or finished on port 80\\. These could be to a web server on the network or web client requests to servers off the network. To narrow this down, you really must filter the flows you examine, run a more specific report, or both. Still, this offers a fairly realistic answer to the question \"How much of the traffic is web browsing or email?\" especially if you use the `+percent-total` option.\n\n### Flow Origination: ip-source-port\n\nTo see the originating port of a flow, use the `ip-source-port` report. Here I'm sorting the ports in ascending order:\n\n```", "```\n\nFlows with a source port of zero (❶) are probably ICMP and certainly not TCP or UDP. It's best to filter your data to only TCP and UDP before running this report. Although ICMP flows use a destination port to represent the ICMP type and code, ICMP flows have no source port.\n\nSource ports with low numbers, such as those in the previously shown report snippet, are almost certainly responses to services running on those ports. In a normal network, port 22 is SSH, port 25 is SMTP, and port 49 is TACACS.\n\n### Flow Termination: ip-destination-port\n\nThe report `ip-destination-port` identifies flow termination ports.\n\n```", "```\n\nThese look an awful lot like the source ports. What gives? Because a flow is half of a TCP/IP connection, the destination port might be the destination for the data flowing from the server to the client. A report on the same data should show just roughly as many flows starting on a port as you terminate on that port. Sorting the report by port makes this very obvious.\n\n### Individual Connections: ip-source/destination-port\n\nPart of the identifying information for a single TCP/IP connection is the source port and a destination port. The `ip-source/destination-port` report groups flows by common source and destination ports. Here, I'm reporting on port pairs and sorting them by the number of octets:\n\n```", "```\n\nThe first connection at ❶ appears to be responses to a web request, coming from port 80 to a high-numbered port. Three separate flows used this combination of ports. Then at ❷ there is IPSec NAT-T traffic on port 4500 and then transmissions to the email server at ❸.\n\nI find this report most useful after I prefilter the data to include only a pair of hosts, which gives me an idea of the traffic being exchanged between the two. You might also use this report to identify high-bandwidth connections and filter on those ports to identify the hosts involved, but if you're interested in the hosts exchanging the most traffic, the `ip-address` report is more suitable.\n\n### Network Protocols: ip-protocol\n\nHow much of your traffic is TCP, and how much is UDP? Do you have other protocols running on your network? The `ip-protocol` report breaks down the protocols that appear on your network. In this example, I'm using the `+names` option to have `flow-report` print the protocol name from */etc/protocols* rather than using the protocol number. Looking up names in a static file is much faster than DNS resolution.\n\n```", "```\n\nAs you can see, clearly TCP and UDP are our most common protocols, but there is also an interesting amount of ESP traffic. ESP is one of the protocols used for IPSec VPNs.\n\nREPORTS COMBINING ADDRESSES AND PORTS\n\n`flow-report` also supports reports that provide source and destination addresses and ports together, in almost any combination. Read the `flow-report` manual page for the specific names of these reports. I find `flow-print` more useful for that type of analysis.\n\n## Traffic Size Reports\n\nHas the number of large data transfers increased on your network over the past few days? If so, `flow-report` lets you dissect your traffic records and identify trends. These reports are most useful when graphed and compared to historical traffic patterns.\n\n### Packet Size: packet-size\n\nHow large are the packets crossing your network? You're probably familiar with the 1,500-byte limit on packet size, but how many packets actually reach that size? The `packet-size` report counts the packets of each size. Here I'm running this report and sorting the results by packet size:\n\n```", "```\n\nAs you can see at ❶, 1,500-byte packets have been seen in five flows, containing a total of 2.7 million bytes (❷). You've seen 1851, (❸) of these 1,500-byte packets. Sorting by packets would identify the most and least common packet size.\n\n### Bytes per Flow: octets\n\nHow large are your individual flows? Do you have more large network transactions or small ones? To answer this, report on the bytes per flow with the `octets` report.\n\n```", "```\n\nThis network had 367 46-octet flows (❶), for a total of 16,882 (❷) octets.\n\nIn a small flow, the number of flows (❸) probably equals the number of packets (❹), and each of these tiny flows has only one packet. When flows contain more data, each flow (❺) contains multiple packets (❻).\n\n### Packets per Flow: packets\n\nThe number of packets in a flow offers an idea of what kind of transactions is most common on your network. The sample DNS queries you looked at in [Chapter 1](ch01.html \"Chapter 1. FLOW FUNDAMENTALS\") had only one packet in each flow, while long-running FTP sessions might have thousands or millions of packets. The packets per flow report `packets` tells you how many flows have each number of packets, as shown here:\n\n```", "```\n\nAs you can see at ❶, this data contains 74,213 one-packet flows, carrying almost 7 million octets. (That sounds so much more impressive than 6.5MB, doesn't it?)\n\n## Traffic Speed Reports\n\nI've had managers ask \"How fast is the network?\" so often that I've given up telling them that the question is meaningless. Saying that you have a gigabit Ethernet backbone sounds good, but it's like saying that your car's speedometer goes up to 120 miles per hour without mentioning that the engine starts making a sickly ratcheting cough at 40 miles per hour. Here are some ways to take a stab at answering that question in something approaching a meaningful way.\n\nNETWORK SPEED CAVEATS\n\nRemember, a long-running connection can pass traffic at different speeds through its lifetime. You've probably seen this yourself when downloading a CD or DVD image from the Internet. The connection might start off very quick, become slower partway through for any number of reasons, and accelerate again later. Flow records include only average speed information. For example, to determine how many packets a flow passed in a second, `flow-report` divides the number of seconds the flow lasted by the number of packets in the flow. This is good enough for most purposes, however, and it's certainly better than you'll get with anything short of packet capture.\n\nMany of these reports are not terribly informative to the naked eye. When you're looking at a list of TCP ports that accepted connections, you can quickly say that, for example, ports 80 and 25 received 75 percent of your traffic. These reports are not so readily interpreted, though they do make good fodder for graphs. I've written these descriptions assuming you'll be feeding the results into a graphing program such as `gnuplot` or OpenOffice.org Calc. Those of you who can interpret these results without further processing can congratulate yourself on being either much smarter or much dumber than myself.\n\n### Counting Packets: pps\n\nAnother critical measure of network throughput is packets per second (pps). Many network vendors describe the limits of their equipment in packets per second. The `pps` report, much like the `bps` report, shows how many flows travel at the given number of packets per second.\n\n```", "```\n\nWow! One flow went at 3,000 packets per second (❶)? Yes, technically, but note that it contained only three packets (❷) and lasted for one millisecond (❸). Multiplying anything by a thousand exaggerates its impact.\n\nAgain, this report isn't terribly useful to the naked eye but can be interesting when graphed.\n\n### Traffic at a Given Time: linear-interpolated-flows-octets-packets\n\nThe `linear-interpolated-flows-octets-packets` report averages all the flows fed into it and lists how many flows, octets, and packets passed each second. I find this the most useful \"speed\" report.\n\n```", "```\n\nThe first column gives the time, in Unix epochal seconds: `1334981479` is equivalent to Saturday, April 21, 2012, at 11 minutes and 19 seconds after midnight, EDT. Each row that follows is one second later. In this second, I passed 35.6 flows, 35334 octets, and 96.8 packets.\n\nThis report is ideal for answering many frequently asked questions, such as \"How much traffic goes between our desktops and the domain controllers at remote sites?\" Take the flow data from your internal connection, run it through `flow-nfilter` once to reduce it to traffic from your desktop address ranges, and then run it through again to trim that down to traffic with your remote domain controllers. Finally, feed the results into `flow-report`, and use the resulting report to generate graphable data.\n\nA little creativity will give you data on things you never expected you could see. For example, TCP resets are a sign of something being not quite right; either a client is misconfigured, a server daemon has stopped working, or a TCP connection has become so scrambled that one side or the other says \"Hang up, I'm done.\"\n\nYou can use `flow-nfilter` to strip your flows down to TCP resets. (One TCP reset is one packet.) Run this report with `-v FIELDS=-octets,-flows` to display only the number of TCP resets in a given second, and you'll then have graphable data on TCP resets on your network.\n\n### Note\n\nAlthough the quality of a network administrator's work is difficult to measure, I suggest offering \"before\" and \"after\" pictures of TCP reset activity during your performance reviews.^([[9](#ftn.CHP-5-FN-2)])\n\n## Routing, Interfaces, and Next Hops\n\nFlow records include information on which interfaces a packet uses. In simple cases, this information isn't terribly useful: If you have a router with one Internet connection and one Ethernet interface, you have a really good idea how packets flowed without any fancy network analysis. A router using BGP, with multiple Internet providers, will distribute outgoing traffic to all Internet providers based on its routing information. Most people use `traceroute` to identify which path the router takes to a particular destination. BGP routing is dynamic, however; the path a packet takes now might not be the path it took five minutes ago or during an outage. Routers that support NetFlow version 5 or newer include interface information with each flow, however, so you can retroactively identify the route a flow used. (Remember, software flow sensors, such as `softflowd`, do not have access to interface information.)\n\n### Interfaces and Flow Data\n\nIn [Chapter 4](ch04.html \"Chapter 4. FILTERING FLOWS\"), you filtered on router interfaces. Reporting on interfaces is the natural extension.\n\nRemember, each router represents its interfaces with numbers. You might think of a router interface as Serial 0, but the router might call it Interface 8\\. A Cisco router might renumber its interfaces after a reboot, unless you use the `snmp ifIndex persist` option.\n\nI'm using the router from [Chapter 4](ch04.html \"Chapter 4. FILTERING FLOWS\") as a source of flow information. On this router, interfaces 1 and 2 are local Ethernet ports, and interfaces 7 and 8 are T1 circuits to two different Internet service providers.\n\n### The First Interface: input-interface\n\nTo see which interface a flow entered a router on, use the `input-interface` report. Here, I'm adding a filter to report on data only for a single router:\n\n```", "```\n\nMost of these flows start on interface 1, with the fewest on interface 2.\n\n### The Last Interface: output-interface\n\nTo show the interfaces that are being used to leave a router, use the `output-interface` report.\n\n```", "```\n\nThe first thing I notice in this output is the sudden appearance of interface 0 at ❶. This is a list of valid router interfaces, and 0 isn't one of them. What gives?\n\nThese are flows that arrived at the router and never left. The appearance of interface 0 prompted me to more closely scrutinize my flow data, and I found flows that appeared to come from IP addresses reserved for internal, private use. Closer inspection of the firewall revealed several rules that allowed internal traffic to reach the Internet-facing network segment without address translation, but the router dropped all traffic from these internal-only RFC1918 addresses. I also found quite a few traffic streams from the public Internet that were sourced from these private IP addresses, but the router dropped them too, as I would expect.\n\nThe lesson to learn is, of course, that proper reporting will do nothing but make more work for you. But at least you'll be able to identify and fix problems before an outsider can use those problems against you.\n\n### The Throughput Matrix: input/output-interface\n\nPutting the `input/output-interface` reports together into a matrix showing which traffic arrived on which interface can be illuminating. Use the `input/output-interface` report for this. Here, I'm sorting the output by the number of flows so you can easily tell which pairs of interfaces see the greatest number of connections.\n\n```", "```\n\nThe busiest connection is between interface 1 (FastEthernet0/0) and interface 2 (FastEthernet0/1), shown at ❶ and ❷. This might or might not make sense, depending on your network topology. In mine, it's expected. You then route traffic out one of the Internet circuits at ❸.\n\nThis report clearly indicates the difference between flows and bytes. As you can see at ❹, one of the connections with a relatively few flows is actually pushing a comparatively large amount of traffic.\n\nNote the absence of flows between interfaces 7 and 8\\. This indicates traffic entering on one of the Internet circuits and leaving by the other. You would have become a transit provider, carrying Internet traffic from one network to another. This would happen if, say, you sold a T1 to a third party and they sent their traffic through you to the Internet. If you're not an Internet backbone, this would be a serious problem.\n\n### The Next Address: ip-next-hop-address\n\nReporting by interface gives you a good general idea of where traffic is going, and reporting by IP address offers a detailed view. For an intermediate view, use the `ip-next-hop-address` report. You do not need to filter this report by the router offering the flows, because the report doesn't confuse the results with interface numbers. This report effectively tells you where the network traffic is going, both for your local hosts and for your upstream providers. I've sorted this report by octets so that the highest-bandwidth next hops appear first.\n\n```", "```\n\nAs you can see in this report at ❶, the most heavily used next hop is the proxy server. This isn't a great surprise.\n\nThe second most heavily used next hop isn't even an address on my network. It's the ISP's side of one of my T1 circuits, as shown at ❷. This hop represents traffic leaving my network. I also have IP addresses for the second (❸) and third ISPs (❹).\n\n### Where Traffic Comes from and How It Gets There: ip-source-address/output-interface\n\n`flow-report` includes reports based on IP addresses and interfaces. Because these reports are so similar, I'll cover two in detail, and I'll let you figure out the rest.\n\nThe `ip-source-address/output-interface` report shows the source address of a flow and the interface the flow left the router on. If you filter your underlying flow data by an individual host of interest and run that data through this report, you'll get information on how much traffic this one host sent to each of your Internet circuits as well as information on how much data that host received from each remote host. In the following report, I'm filtering by the router exporting the flows to avoid interface number confusion and by the IP address of my main external NAT address:\n\n```", "```\n\nThe first entry at ❶ gives the proxy server itself as a source address and shows that I sent many flows out interface 2\\. That's an Ethernet to another local network segment. You also see at ❷ that the proxy sent large amounts of traffic out interface 8, one of the Internet connections.\n\nYou'll see entries at ❸ for remote IP addresses that send a comparatively small number of flows.\n\nThe surprising entry here is at ❹ where the proxy server sends a really small amount of traffic out interface 7, the other Internet circuit. Measurements show that this other circuit is consistently heavily used. Whatever is using this circuit isn't the main proxy server, however. I could identify the traffic going out over this circuit by removing the filter on the main proxy server and adding a filter for interface 7\\. I'll do that with a different report.\n\n### Where Traffic Goes, and How It Gets There: ip-destination-address/input-interface\n\nAfter viewing the results of the previous report, I'm curious about what hosts exchange traffic over interface 7\\. In [Chapter 4](ch04.html \"Chapter 4. FILTERING FLOWS\"), I created a filter that passed all traffic crossing interface 7\\. You'll use that filter on traffic from this router together with a flow report to see what's happening. Rather than reporting on the source address and the output interface, you'll use `ip-destination-address/input-interface` to see where traffic arriving on a particular interface is going. The resulting command line might be long enough to scare small children, but it will answer the question.\n\n```", "```\n\nRemember, I designed the filter `interface7` so that it matched traffic either entering or leaving over interface 7\\. That's why this report includes both output interfaces 1 and 7.\n\nTwo local hosts, both web servers, receive most of the traffic sent to you over this router interface. More investigation shows that the Internet provider for this line has good connectivity to home Internet providers, such as Comcast and AT&T. The other provider has better connectivity to business customers. (How do you know what kind of connectivity your providers have? You can extract this information from the BGP information in flow records.)\n\n### Other Address and Interface Reports\n\nFlow-report includes two more reports for interfaces and addresses, `ip-source-address/input-interface` and `ip-destination-address/output-interface`. After the previous two examples, you should have no trouble using or interpreting these reports.\n\n## Reporting Sensor Output\n\nIf you have multiple sensors feeding a single collector, you might want to know how much data each sensor transmits. Use the `ip-exporter-address` report to find that out.\n\n```", "```\n\nAs you can see in this report, records from the first router included fewer flows but more octets than those from the second router. Your results will vary depending on the throughput of each of your routers, the kind of traffic they carry, and their sampling rate.\n\n## BGP Reports\n\nFlow records exported from BGP-speaking hardware include Autonomous System (AS) information. Reporting on this information tells you which remote networks you are communicating with and even how you reached those networks. If your network does not use BGP, these report types are of no use to you, and you can skip the rest of this chapter.\n\nFlow-tools includes many reports and tools of interest to transit providers, but few if any readers of this book are transit providers. BGP-using readnsers are probably clients of multiple ISPs and use multiple providers for redundancy. I'll cover flow BGP information from the BGP user's perspective. Transit providers reading this book^([[10](#ftn.CHP-5-FN-3)]) are encouraged to read the `flow-report` manual page for a complete list of reports involving AS numbers.\n\n### Using AS Information\n\nWhat possible use can this type of AS information be for a network engineer? Knowing who you exchange traffic with might have little impact on day-to-day troubleshooting, but it has a great impact on who you purchase bandwidth from.\n\nWhen the time comes to choose Internet providers, run reports to see who you consistently exchange the most traffic with. If you know that you consistently need good connectivity to three particular remote networks, use them as bullet points in your negotiations with providers. If you don't make bandwidth purchasing decisions, provide the decision maker with this information. The statement \"40 percent of our Internet traffic goes to these three companies\" is much more authoritative than \"I worked with company X before, and they were pretty good.\"\n\n### Traffic's Network of Origin: source-as\n\nThe `source-as` report identifies the AS where flows originated. I'll sort this report by octets, because that's how I pay for bandwidth.\n\n```", "```\n\nThe invalid AS `0` appears first at ❶. When traffic originates or terminates locally, flow sensors do not record an AS number for the local end of that traffic, which means that your local AS number will never appear in a flow report. The source AS of traffic you transmit shows up as `0`, and the destination address of traffic you receive is also shown as `0`. The only time you will see both a source and a destination AS number in a flow record is if the exporter is a transit provider, such as an Internet backbone. Traffic coming from AS `0` is the total of all traffic sourced by your network and transmitted to other networks. You might want to filter out all flows with a source AS of `0` from your data before running the report to remove the information about the data that your network transmits.\n\nIn the hour shown in the earlier report, the largest amount of traffic originated from AS `14779` (Inktomi/Yahoo!, shown at ❷), but it included only two flows. I suspect that if you were to filter this same data on AS `14779` and run `flow-print` against it, you'd see that someone had downloaded a file, and I would further guess that the proxy logs would show that someone needed printer software. You can repeat this exercise for each of the AS numbers in the list.\n\n### Destination Network: destination-as\n\nTo see where you're sending traffic to, use the `destination-as` report. For a slightly different view of traffic, sort by the number of flows.\n\n```", "```\n\nAs you can see at ❶, you sent more flows to AS `702` than you received from everybody else combined (shown at ❷). Also note at ❸ that AS `701` belongs to the same organization as AS `702`, but `flow-report` does not aggregate them. Different autonomous systems within one organization almost certainly have slightly different routing policies, despite the best efforts of their owner to coordinate their technical teams.\n\n### BGP Reports and Friendly Names\n\nThe BGP reports can use friendly names, which will save you the trouble of looking up the owner of interesting AS numbers. Although `whois` is a fast command-line tool for checking the ownership of AS numbers and you can look up AS information on any number of registry websites, none of these interfaces is suitable for automation. `flow-tools` gets around this by keeping a static list of AS assignments in the file *asn.sym*. Registries are continuously assigning and revoking AS numbers, however, so the list included with `flow-tools` will quickly become obsolete. To get the best information on AS names, you must update `flow-tools`' list of AS numbers.\n\nTo update the list of AS numbers, first download the latest list of ARIN assignments from [ftp://ftp.arin.net/info/asn.txt](ftp://ftp.arin.net/info/asn.txt), and save it on your analysis server.\n\nFlow-tools includes *gasn*, a small script to strip out all of ARIN's comments and instructions and convert ARIN's list to a format it understands. The standard `flow-tools` installation process doesn't install this rarely used program in one of the regular system program directories, but you can probably find it under */usr/local/flow-tools/share/flow-tools* if you installed from source. Use `locate gasn` to find the program if you installed from an operating system package.\n\nHere, you feed ARIN's *asn.txt* in the current directory to the *gasn* script located in */usr/local/flow-tools/share/gasn* and produce a new file, *newasn.sym*:\n\n```", "```\n\nTake a look at your *newasn.sym* file. The contents should resemble these:\n\n```", "```\n\nAs of this writing, this file contains more than 64,000 AS numbers, each on its own line.\n\nYour system should already have an existing *asn.sym* file, possibly in */usr/local/etc/flow-tools/* or */usr/local/flow-tools/etc/sym/*. Replace that file with your new file. When you add the `+names` option to `flow-report`, you should see the current AS names.\n\n```", "```\n\nNot all AS numbers have sensible names, especially those that are acronyms or words in foreign languages, but you can easily pick out some of the obvious ones and identify the others with `whois`.\n\n* * *\n\n^([[9](#CHP-5-FN-2)]) Remember that a certain level of TCP reset activity is normal, and much of it is caused by buggy or graceless software. Do *not* let your boss give you a goal of \"zero TCP resets\" during your performance review.\n\n^([[10](#CHP-5-FN-3)]) Both of you.\n\n# Customizing Reports\n\nI use command-line reports for occasional analysis on an ad hoc basis, such as when I'm trying to find patterns in problematic traffic. If you're going to regularly use a report with a long command line, I recommend creating a customized report. Writing truly custom detailed reports of the type I've been demonstrating requires programming, but `flow-report` lets you highly customize existing reports.\n\nThe *stat.cfg* file contains flow report definitions. You'll probably find this file in */usr/local/flow-tools/etc/cfg* or */usr/local/etc/flow-tools*, depending on how you installed `flow-tools`. The only report that comes in *stat.cfg* is the default report. Don't touch it; it's what makes the various command-line reports function. Add your custom changes below it.\n\nSetting variables on the command line does not work in customized reports because the reason to customize a report is to avoid typing all those command-line variables. You can create a report that will accept command-line modifications, but to do so, you'll need to understand how to write basic reports first. To create such a report, study the default report in *stat.cfg*.\n\n## Custom Report: Reset-Only Flows\n\nI frequently use `flow-report` to create graphable data on flows that contain only TCP resets. These flows can indicate misconfigured software, network equipment, or general system cussedness. Some of the best graphable data comes from the `liner-interpolated-flow-octets-packets` report. Let's create such a report. My goal is to be able to run the report very simply, like this:\n\n```", "```\n\nUse `-S` to tell `flow-report` that you're running a customized report. The new report will be named `resets-only`.\n\nA minimal report in *stat.cfg* looks like this:\n\n```", "```\n\nMuch like a `flow-nfilter` filter, a customized flow report has two main components: the `stat-report` and the `stat-definition`. The `stat-report` at ❶ is somewhat like a filtering primitive. This customized `stat-report` is called `packets`, for reasons that will become clear later.\n\nThe `stat-report` needs to know what type of `flow-report` it is based on, as shown at ❷. The `resets-only` report starts life as the `linear-interpolated-flows-octets-packets` report. At ❸ we tell the `resets-only` report to produce output.\n\nThe `stat-definition` at ❹ lets you aggregate multiple `stat-reports` into a single report. This definition includes only a single report, named `resets`. Even with this minimal definition, you can already run the `resets-only` report. The resulting numbers will be identical to setting `TYPE=linear-interpolated-flows-octets-packets` on the command line even though it appears slightly different.\n\n```", "```\n\nThe first thing you'll notice in the previous report is that `flow-report` creates comma-separated value (CSV) reports by default. This is perfectly fine if you're going to feed the results to a graphing program, but CSV data gives me a headache when I have to read it. A graphing program can read tab-delimited data just as easily as CSV, so let's make the report produce human-friendly output.\n\n### Report Format and Output\n\n`flow-report` uses the external program `flow-rptfmt` to improve the output's appearance. Let's direct the output into `flow-rptfmt`.\n\n```", "```\n\nThe `path` variable at ❶ tells `flow-report` where to send the output. By using a path that starts with a pipe symbol (`|`), you tell `flow-report` to feed its output to a program, just like a pipe on the command line. Everything after the pipe is run as a command. Here I'm using the standard report formatting software, `flow-rptfmt`. Adding a formatting program to the report produces this output:\n\n```", "```\n\nYou'll learn more about using `flow-rptfmt` and other output options in [Customizing Report Appearance](ch05s06.html#customizing_report_appearance \"Customizing Report Appearance\") in [Customizing Report Appearance](ch05s06.html#customizing_report_appearance \"Customizing Report Appearance\").\n\n### Removing Columns\n\nYou're interested in counting the number of TCP resets that occur over time. (One TCP reset is one packet.) The octets and packets columns are irrelevant, so remove them.\n\n```", "```\n\nThis works exactly like removing fields on the command line. The `fields` header at ❶ tells `flow-report` which columns to remove. Removing the octets and flows fields from this report gives you output much like the output shown next, and you now see only the data of interest:\n\n```", "```\n\n### Applying Filters to Reports\n\nThe report lists times and the number of packets, so you're headed in the right direction. But it's listing the total number of packets in the flow file, not just the TCP resets. You need to add a filter to strip away everything except the data you're interested in. You could use a filter on the command line, of course, but the purpose of a customized report is to reduce the amount of typing you do.\n\n`flow-report` lets you add a filter in either the `stat-report` or the `stat-definition`. I define my filter in the `stat-definition`. Recall from [Chapter 4](ch04.html \"Chapter 4. FILTERING FLOWS\") that you configured the `rst-only` filter to pass only TCP resets.\n\n```", "```\n\nThe report output now looks like this:\n\n```", "```\n\nThis network has a low number of TCP resets, but if you page through the results, you'll see peaks and valleys of reset-only flows. You'll use this data, among others, to create graphs in [Chapter 8](ch08.html \"Chapter 8. AD HOC FLOW VISUALIZATION\").\n\n### Combining stat-reports and stat-definitions\n\nIf you can use filters in either a `stat-report` or a `stat-definition`, why did I put the filter in my `stat-definition`?\n\nLook at the `packets stat-report`. I wrote it to display reset-only TCP flows, but it is really just a linearly interpolated packet count. You can use this same `stat-report` elsewhere to create customized reports on data filtered differently. For example, if you had a filter to show all your SYN-only flows, you could use the `packets stat-report` to create data for both.\n\n```", "```\n\nBoth the `reset-only` and `syn-only` reports format and present their results identically. The only difference is the filter applied to create each report.\n\n## More Report Customizations\n\nAny customization you can perform on the command line will also work in a customized report, but the configuration file supports additional features as well.\n\n### Reversing Sampling\n\nSome flow sensors sample flows only, sending just a fraction of their data to the flow collector (see [Chapter 2](ch02.html \"Chapter 2. COLLECTORS AND SENSORS\")). This is better than having no flow data but can confuse reporting. To improve this situation, you can tell `flow-report` to scale up its output to compensate for sampling. For example, if your router samples at a rate of 1:10, you can scale up the output by a factor of 10 to get traffic volumes roughly comparable to the original. The report here scales the source and destination IP addresses:\n\n```", "```\n\nThe `scale` keyword at ❶ defines a scaling multiplier. Take a look at the output from this report:\n\n```", "```\n\nI've copied this report to `subnets-unscaled` and removed the `scale` command. Let's compare the output.\n\n```", "```\n\nThe source and destination addresses are unchanged, as is the number of flows, but the octet and packet counts have increased tenfold in the scaled report. This gives you a mostly accurate view of the amount of traffic passing through your network. Although you're still entirely missing data on some flows, this is about as close to reality as you can get from sampled data.\n\n### Filters in stat-report Statements\n\nTo use a filter in a `stat-report` statement, you must place it before the output definition. For example, the following `filter` statement applies the specified filter to your data before reporting:\n\n```", "```\n\n### Reporting by BGP Routing\n\nPerhaps you're interested in internetwork connectivity rather than connectivity between individual IP addresses. If your flow records include BGP information, you can have `flow-report` generate reports using network block data. To do so, set the `ip-source-address-format` and `ip-destination-address-format` options to `prefix-len`, and `flow-report` will print the netmask with each entry.\n\n```", "```\n\nHere you've told `flow-report` to include the netmask in the source (❶) and destination (❷) addresses. The report now looks like this:\n\n```", "```\n\nYou can see at ❶ that 192.0.2.37 is routed as a /25 network. Although a /25 is too small to be announced on the public Internet, these addresses are local. The router had better know the netmask of directly attached networks! You also see that, for example, the address 198.6.1.1 at ❷ is announced as a /16.\n\nTo have `flow-report` aggregate data by network, set the address format to `prefix-mask`. Here's the same report on the same data, using the `prefix-mask` format:\n\n```", "```\n\nNow you no longer see individual IP addresses. Instead, you see source address blocks as they are routed. You're sending traffic from some addresses inside the 63.112/12 range (❶) to addresses inside 87.128/10\\. `flow-report` has aggregated all the individual connections from one block to another.\n\nLook at the second line of each of these reports. The first report shows that you sent 8,233 flows from the address 192.0.2.37 to the address 158.43.128.72\\. The report with the address mask set says that you sent 23,663 flows (❷) from addresses inside the block 192.0.2/25 to addresses inside 158.43/16\\. This line on the second report includes all the flows from the entry you checked in the first report, plus other flows that fit within those address blocks. They've been aggregated.\n\n## Customizing Report Appearance\n\n`flow-report` supports many options for customizing presentation. Use these options in the `stat-report` definition only beneath the word `output`. Using them earlier will generate an error.\n\n### flow-rptfmt Options\n\nRemember, setting `path` to a pipe followed by a program name tells `flow-report` to feed its output into that program. Everything after the pipe is executed as a regular shell command. This means you can do things such as redirect the output to a file.\n\n```", "```\n\nThe previous line would have the report appear in the file */tmp/resets.txt* rather than on the screen.\n\nIf you prefer, `flow-rptfmt` can produce a very simple HTML table of its output by adding the `-f html` arguments to activate this function, as shown next. ( You'll probably want to redirect the output to a file under your web server's root directory.)\n\n```", "```\n\nOf course, dumping regularly produced reports to a single file probably isn't useful. What you really need is a way to send the output to a file based on timing information.\n\n### Dump CSV to a File\n\nAlthough `flow-rptfmt` is the standard tool for formatting reports, you might decide that the plain-text CSV works better for some purposes, such as for automated graph creation. If you set `path` to a filename, `flow-report` will dump raw CSV text straight to that file, which is most useful if you automatically process the data.\n\n```", "```\n\n### Using Time to Direct Output\n\nA `stat-report` definition can create and use timing information when saving CSV files using the `time` option and special characters in the `path` setting.\n\nBefore using this definition, decide which time you want `flow-report` to use. Do you want to use the current time or the time in the flow files? If the time in the flow files, do you want the time when the flows begin or end? Control this with the `time` option using one of four different time values: `now` (the time when the report is run), `start` (the time the first flow begins), `end` (the time the last flow ends), or `mid` (the average of the start and end times, the default). For most uses, the default is fine.\n\nThe path value can accept variables from the `strftime` library. [Table 5-1](ch05s06.html#some_strftime_variables_for_flow-report \"Table 5-1. Some strftime Variables for flow-report\") lists the most common ones. If you need a time representation that isn't listed in this table, such as the day of the year, the day of the week as a numerical value, or the current time zone as expressed as minutes offset from universal time, read the manual page.\n\nTable 5-1. Some `strftime` Variables for `flow-report`\n\n| Variable | Replaced with |\n| --- | --- |\n| `%a` | Abbreviated day name (Mon, Tue, and so on) |\n| `%b` | Abbreviated month name (Jan, Feb, and so on) |\n| `%d` | Day of the month as a number (131) |\n| `%H` | Hour as per 24-hour clock (00–23) |\n| `%M` | Minutes (0–59) |\n| `%m` | Month (1–12) |\n| `%Y` | Four-digit year (0–9999) |\n| `%y` | Two-digit year (00–99) |\n\n`flow-report` can use the `strftime` variable values to direct output. For example, suppose you want to have the report output directed into a file with a name based on the time, in a directory hierarchy based on the year, month, and day. Use the `strftime` variables to name the file and to choose a directory to place the file, as shown here:\n\n```", "```\n\nThis report uses the `time` the last flow ends (❶). As shown at ❷, the results will appear in a file under a directory named for the year, month, day, and hour, and they use the last time in the file for the filename. For example, if I'm reporting on flow data from December 1, 2011, between 8 **am** and 8:59 **am**, the results would appear in the directory */tmp/2011/12/01/08*.\n\n### Note\n\nAlthough `flow-report` will expand `strftime` variables and hand the correct numbers to `flow-rptfmt`, `flow-rptfmt` cannot create missing directories.\n\nThe following report places HTML reports in a directory under the web root, using filenames based on the year, month, day, and hour of the data you're reporting on:\n\n```", "```\n\n### Set Sorting Order\n\nUse the `sort` output option to control which column the report sorts on. This works the same as if you changed sorting on the command line. Use any column name in the report as the value for `sort`. A leading plus sign says start with the largest value and go down; a leading minus sign means start with the smallest and go up. The following example `stat-report` tells you what remote address ranges your network communicates with most because you list the highest traffic networks first by sorting on octets.\n\n```", "```\n\n### Cropping Output\n\nFlow reports can run to hundreds or thousands of lines. Often you don't want the entire report and instead want merely the first entries, whether that's the first five or the first 500, but there's no sense in creating the 50,000-line report just to get those few entries. The `records` option gives the maximum number of results to show. Here, I'm adding a `records` entry to the previous report:\n\n```", "```\n\nThe report is no longer a list of all the networks you communicate with. Instead, it's the top five networks you communicate with.\n\n### Other Output Options\n\nYou might or might not want header information, percentages, and so on, in your customized report. Control these with the `options` keyword. (I discussed these options in [Displaying Headers, Hostnames, and Percentages](ch05s04.html#displaying_headers_comma_hostnames_comma \"Displaying Headers, Hostnames, and Percentages\") in [Displaying Headers, Hostnames, and Percentages](ch05s04.html#displaying_headers_comma_hostnames_comma \"Displaying Headers, Hostnames, and Percentages\").) Here I'm turning off the informational headers:\n\n```", "```\n\n### Alternate Configuration Files\n\nAs you proceed, you might find yourself with an increasing number of customized reports used by more and more people. Reports, like filters, will not work if the configuration file is not parseable. As more people and processes run reports, you might find it difficult to develop new reports without annoying other system users or interrupting scheduled jobs. If so, tell `flow-report` to use a different configuration file than the default with the `-s` flag.\n\n```"]